var Accept = prompt('سلام عزیزم میبینم که به کمک من احتیاج پیدا کردی، میخوای میانگین نمراتت رو ببینی؟ فقط بهت بگم من بیشتراز 5 نمره رو نمیتونم دریافت کنما !! میکنم ولی باید قبلش اشتراک داشته باشی. پس اگه میخوای ادامه بدی و رایگان میانگین اون 5 نمره رو ببینی کلمه بله رو ارسال کن.');
if (Accept == 'بله') {
    alert('خیلی خب ، برای به دست اوردن میانگین نمراتت، 5 تا باکس به ترتیب برات باز میشه فقط باید همه رو پر کنیا ی دونه رو خالی بزاری برات محاسبه نمیکنم و حواست باشه که اعداد رو به صورت لاتین وارد کنی، از باکس بعدی شروع کن به قرار دادن نمراتت. بزن بریم');
    var Score1 = prompt('نمره اول');
    if (Score1 == '') {
        alert(' نکن دیگه این کارو با من عددو یا وارد کن یا کلا بدو بروووووووو');
    }
    else {
        var Score2 = prompt('نمره دوم');
        if (Score2 == '') {
            alert(' وارد نکردی سوختی برو از اول بیا');
        }
        else {
            var Score3 = prompt('نمره سوم');
            if (Score3 == '') {
                alert(' وارد نکردی سوختی برو از اول بیا');
            }
            else {
                var Score4 = prompt('نمره چهارم');
                if (Score4 == '') {
                    alert(' وارد نکردی سوختی برو از اول بیا');
                }
                else {
                    var Score5 = prompt('نمره پنجم');
                    if (Score5 == '') {
                        alert(' وارد نکردی سوختی برو از اول بیا');
                    }
                    else {
                        alert('خیلی خب تموم شد بریم نتیجه رو ببینیم');
                        var Av = ((Number(Score1) + Number(Score2) + Number(Score3) + Number(Score4) + Number(Score5)) / 5);
                        alert('خیلی هم عالی مرسی که اعداد رو وارد کردی راستش سیستم خراب شده کار نمیکنه بهت فرمولشو میدم خودت برو با ماشین حساب، حساب کن. ببین برای محاسبه میانگبن باید همه اعدادتو باهم جمع کنی بعد تقسیم بر تعداد اعداد کنی مثلا الان 5 تا وارد کردی، 5تا عددو با هم جمع کن بعد تقسیم بر 5 کن ، تمومممم، مرسی که تا اینجای راه با من همراه بودی. 😁😀');
                        alert('شوخی کردم حالا چرا عصبی شدی میانگین نمرهات شد ' + Av);
                    }
                }
            }
        }
    }
}
else {
    alert('ایشالا ی روز همه چی رایگان میشه توهم به ما سر میزنی😢')
}