var Accept = prompt('سلام عزیزم میبینم که به کمک من احتیاج پیدا کردی، میخوای میانگین نمراتت رو ببینی؟ فقط بهت بگم من بیشتراز 5 نمره رو نمیتونم دریافت کنما !! میکنم ولی باید قبلش اشتراک داشته باشی. پس اگه میخوای ادامه بدی و رایگان میانگین اون 5 نمره رو ببینی کلمه بله رو ارسال کن ، راستی برای خرید اشتراک هم میتونی کلمه اشتراک رو تایپ کنی..');
if (Accept == 'بله') {
    alert('خیلی خب ، برای به دست اوردن میانگین نمراتت، 5 تا باکس به ترتیب برات باز میشه فقط باید همه رو پر کنیا ی دونه رو خالی بزاری برات محاسبه نمیکنم و حواست باشه که اعداد رو به صورت لاتین وارد کنی، از باکس بعدی شروع کن به قرار دادن نمراتت. بزن بریم');
    var Score1 = prompt('نمره اول');
    if (Score1 == '') {
        alert(' نکن دیگه این کارو با من عددو یا وارد کن یا کلا بدو بروووووووو');
    }
    else {
        var Score2 = prompt('نمره دوم');
        if (Score2 == '') {
            alert(' وارد نکردی سوختی برو از اول بیا');
        }
        else {
            var Score3 = prompt('نمره سوم');
            if (Score3 == '') {
                alert(' وارد نکردی سوختی برو از اول بیا');
            }
            else {
                var Score4 = prompt('نمره چهارم');
                if (Score4 == '') {
                    alert(' وارد نکردی سوختی برو از اول بیا');
                }
                else {
                    var Score5 = prompt('نمره پنجم');
                    if (Score5 == '') {
                        alert(' وارد نکردی سوختی برو از اول بیا');
                    }
                    else {
                        alert('خیلی خب تموم شد بریم نتیجه رو ببینیم');
                        var Av = ((Number(Score1) + Number(Score2) + Number(Score3) + Number(Score4) + Number(Score5)) / 5);
                        alert('خیلی هم عالی مرسی که اعداد رو وارد کردی راستش سیستم خراب شده کار نمیکنه بهت فرمولشو میدم خودت برو با ماشین حساب، حساب کن. ببین برای محاسبه میانگبن باید همه اعدادتو باهم جمع کنی بعد تقسیم بر تعداد اعداد کنی مثلا الان 5 تا وارد کردی، 5تا عددو با هم جمع کن بعد تقسیم بر 5 کن ، تمومممم، مرسی که تا اینجای راه با من همراه بودی. 😁😀');
                        alert('شوخی کردم حالا چرا عصبی شدی میانگین نمرهات شد ' + Av);
                    }
                }
            }
        }
    }
}
else if (Accept == 'اشتراک') {
    alert('با خرید هر اشتراک از ما هدیه بگیرید فقط کافیه که یکی از سه اشتراک زیر رو تهیه کنی')
    var SubscriptionType = prompt('اشتراک یک ماهه 250 هزار تومان ، دو ماهه 400 هزارتومان و یک ساله 710هزار تومان که هر کدام ازا این اشتراک ها رو با تخیف 52 درصدی میتونی تهیه کنی. برای سفارش عدد 1 برای یک ماهه،2 برای دو ماهه و 3 برای یک ساله را ارسال کنید.')
    if (SubscriptionType == '1') {
        var SubscriptionType1 = prompt('مطمعنی میخوای یک ماهه بخری؟ بیا ی تخفیف خیلی خوب بدم بهت یک ساله رو ببر. ببین یک ساله رو 100 تومن میدم فقطم به تو میدم با این قیمت، اگه خواستی دوباره عدد 1 رو ارسال کن اگه هم نه عدد 2 رو بفرس ')
        if (SubscriptionType1 == '1') {
            var Takhfif = prompt('از اولشم معلوم بود خریداری خب شماره کارتمو میدم سریع بزن حساب تا تموم نشده فیششم برام بفرست. بعد از تکمیل خریدتم اینجا اعلام کن که خریدی مثلا بگو خریدم 6219861909440934 امین گودرزی')
            if (Takhfif == '') {
                alert('تو که نمیخواستی بخری چرا مارو الاف خودت کردی؟؟؟؟ مسخره')

            }
            else if (Takhfif == 'خریدم') {
                alert('سفارش شما با شماره پیگیری: بدو تا به پولت برسی. ثبت شد از خرید شما سپاس گزاریم 🤩')
            }
        }
        else if (SubscriptionType1 = '2') {
            var Kharid1 = prompt('خدایی چرا میخوای یک ماهه بخری من که مفت دارم میدم بره فقط خودت نخواستیا ، بعدا میای گرونتر میخری میفهمی چی به چیه. الان هم برای ثبت سفارشت 300 میزنی به کارتم ، دلیل اضافه شدنش هم اینه که شامل شما نمیشه تخفیف و 50 هزار تومن هزینه ثبت و راه اندازیه. بعد از اینکه هزینه را واریز کردید فیشش رو ارسال کنید و کلمه خریدم هم اینجا وارد کنید. 6219861909440934 امین گورزی')
            if (Kharid1 = '') {
                alert('از اولشم معلوم بود خریدار نیستی برو از جای دیگه بخر دفعه بعدی هم توی سایتم لاگین کنی هکت میکنم.')
            }
            else if (Kharid1 = 'خریدم') {
                alert('واقعا باید بهتون گرون بدن تا بخرین همیشه برام ادمایی مثل شما عجیبن. سفارش شما با کد: بدو دنبالش تا بگیریش. ثبت شد. از خرید شما متشکریم')
            }
        }
    }
    else if (SubscriptionType == '2') {
        var Kharid2 = prompt('شما اشتراک 2 ماهه با قیمت 400 هزار تومان را انتخاب کردید برای ثبت سفارش مبلغ رو به شماره کارت 6219861909440934 امین گودرزی کارت به کارت کنید و در اینجا کلمه خریدم را تایپ و ارسال کنید.')
        if (Kharid2 == '') {
            alert('نخریدی دیگه؟؟؟ فقط تا اینجا اومدی ببینی چیه؟ باشه اشکالی نداره برو منم خدایی دارم')
        }
        else if (Kharid2 == 'خریدم') {
            alert('از خرید شما متشکریم منتظر دریافت نام کاربری و رمز عبور در روزهای اینده باشید.')
        }
    }
    else if (SubscriptionType == '3') {
        alert('شما اشتراک یک ساله را انتخاب کردید مبارکتون باشه نیازی به پرداخت هزینه نیست و میتونید با این نام کاربری و رمز به صورت نامحدود از سایت اسفتاده کنید')
        var Kharid3 = prompt('جدی دنبال نام کاربری و رمزی؟ اونم رایگان؟ هزینه رو به شماره کارت 6219861909440934 امین گودرزی واریز کن بعد نام کاربری و رمز برات ارسال میشه فقط بعد از واریز کلمه خریدم رو تایپ و ارسال کن')
        if (Kharid3 == ' ') {
            alert('بازم فکر کردی همینجوری بزنی بری اوکیه؟ پول نریختی از اشتراک هم خبری نیست')

        }
        else if (Kharid3 == 'خریدم') {
            alert('سفارش شما ثبت شده منتظر بمون تا برات ارسال کنم')

        }
    }
}
